handouts/technical-primer.org
#+title: Technical primer 
#+subtitle: Syntax, semantics, and proof theory of the Simply-Typed Lambda Calculus
#+author: Patrick D. Elliott
#+bibliography: ../../bibliography/master.bib
#+setupfile: ./handout-template.org
#+OPTIONS: ':t
#+cite_export: biblatex

* Reading

- Chaper 4 of Liz Coppock and Lucas Champollion's /Invitation to Formal Semantics/: [[https://eecoppock.info/bootcamp/semantics-boot-camp.pdf]]

* Prerequisites

I'll be teaching this class presupposing the following background:

- At least one introductory course on compositional semantics, with similar coverage to, e.g., /Semantics in Generative Grammar/ [cite:@HeimKratzer1998] or Coppock and Champollion's /Invitation to Formal Semantics/.
- Basic knowledge of:
  * Set theory.
  * Logic (propositional and first order).
    
The main formal analytical tool we'll be making use of in this class is the /Simply-Typed Lambda Calculus/, which you should already have some familiarity with. Before we dive into linguistic issues, we'll spend some time going through the basics.

Note that the specific choices we'll make in developing our calculus result in what is known as /higher-order logic/; the calculus itself can be used to model any (halting!) computations, such as arithmetical computations; we'll be using it specifically to compute /truth-conditions/.[fn:2] 

* Syntax of the Simply-Typed Lambda Calculus (STLC)

The lambda calculus was invented by Alonso Church in the early 20th century as a formal language for talking about functions.

The simply-typed variant has been overwhelmingly adopted in formal semantics as a kind of /lingua france/ for reasoning about how complex meanings are composed from simpler meanings.

Note that the discussion here is primarily based on Chapters 2 and 3 of [cite:@Carpenter1998].

** Types

You can think of types as the /syntactic categories/ of the STLC - they provide formal constraints on what kind of things can combine.

There are just two kinds of types we'll see in this course:

- Basic types: \(E, T\)
- Function types.
  
The basic types are just that - primitives. \(E\) is used to classify expressions of the STLC which denote /individuals/, and \(T\) is is used to classify expressions which denote /truth-values/.

We'll exploit a general recipe for talking about /function types/.

#+begin_definition
*Function types*. If \(\sigma\) and \(\tau\) are *types*, then \(\sigma \to \tau \) is a *function type*.
#+end_definition

Note that we can use our function type recipe to generate an /infinite/ number of types! Unlike in many grammatical formalisms (with the notable exception of categorial grammars), we have, in essence, an infinite number of syntactic categories.[fn:1]

We use function types to classify expressions which denote functions. For example, \(T \to T\) is the type of a function from truth-values to truth-values (this might be exploited for something like negation).

N.b. that \(\to\) is /right-associative/, which means that, e.g., \(E \to E \to  T\) is parsed as \(E \to (E \to T)\) (not \((E \to  E) \to  T\)!).

Some types that we'll frequently see:

- \(E_1 \to \ldots E_n \to T\): the type of a verbal predicate that takes \(n\)-arguments.
- \((E \to T) \to T\): the type of a quantificational expression.
- \((E \to T) \to (E \to T) \to T\): the type of a determiner.
- \(T \to T \to T\): the type of a logical connective
 

** Variables and constants

Expressions of the STLC are built up out of variables and constants, which you can conveniently think of as the "lexical items".

Variables and constants are categorized by /type/.

Every type is associated with a (countably infinite!) set of variables.

You can use anything you like as a variable name. We'll typically use \(x,y,z,\ldots\) for variables of type \(E\), \(P,Q,R,\ldots\) for variables of type \(E \to T\), etc., but ultimately it doesn't matter much what we use as variable names. 

Constants will typically be used to talk about 'lexical' concepts, i.e., \(\mathbf{Louise}\) is a constant of type \(E\), \(\mathbf{run}\) is a constant of type \(E \to T\), and \(\mathbf{not}\) is a constant of type \(T \to T\).

You can be explicit about the types of constants and variables using type annotations, but these can be omitted when the type is obvious:


- \(\mathbf{Louise}_E\), \(\mathbf{run}_{E \to T}\)
- \(x_E\), \(R_{E \to E \to T}\) 
  
It's also common to use a colon when declaring the type of an expression:

- \(\mathbf{Louise} : E\)

