handouts/technical-primer.tex

\subsection{functional applications}
\label{sec:orgc4f0021}

The types of expressions delimits the role they can play in building complex expressions (again, this should be familiar from natural language syntax).

The most fundamental such complex expression is a \textbf{functional application}; you can think of this is the STLC counterpart of \emph{merge}; when we translate binary branching trees into expressions of the STLC, each non-terminal node will typically correspond to a functional application.

\begin{definition}
\textbf{functional application}: If \(\alpha\) is an expression of type \(\sigma \to  \tau\), and, \(\beta\) is an expression of type \(\sigma\), then \(\alpha (\beta)\) is a \emph{functional application} of type \(\tau\).
\end{definition}

Crucially, the type system restricts what counts as a well-formed application (just like syntactic categories restrict what can merge with what).

For example, \(\mathbf{not}(\mathbf{Josie})\) is an ill-formed application, assuming that \(\mathbf{not}: T \to T\), and \(\mathbf{Josie}: E\).

Are the following well-formed expressions of the lambda calculus? What is their type?

\begin{exe}
\ex \(\mathbf{hugs}_{E \to E \to T}(\mathbf{Louise}_{E})\)
\ex \(\mathbf{Josie}_E(\mathbf{left}_{E \to T})\)
\ex \(\mathbf{not}_{T \to T}(\mathbf{sad}_{E \to T}(\mathbf{Sarah}_E))\)
\ex \(\mathbf{and}_{T \to T \to T}(\mathbf{run}_{E \to T}(\mathbf{Louise}_E))\)
\label{orgb078144}
\end{exe}

Unlike in predicate logic, we have no way of talking about \(n\)-ary predicates in the \(STLC\), rather an \(n\)-ary predicate is always encoded as a \emph{curried} function; complex expressions are then built up by successive applications. In other words, when we consider the syntax of the STLC, binary branching is forced.

\begin{exe}
\ex \(\mathbf{give}: E \to E \to E \to T\)
\ex \(\mathbf{kiss}: E \to  E \to T\)
\ex \(\mathbf{and}: T \to T \to T\)
\label{org8ca0740}
\end{exe}

One way of visualizing the structure of a complex expression is as a tree diagram, where each non-terminal node represents a functional application.

\begin{exe}
\ex
  \begin{forest}
    [{\((((\mathbf{show}(\mathbf{thePendant}))(\mathbf{Chrono}))(\mathbf{Marle}): T\)\\functional application}
      [{\((\mathbf{show}(\mathbf{thePendant}))(\mathbf{Chrono}): E \to T\)\\functional application}
        [{\(\mathbf{show}(\mathbf{thePendant}) : E \to E \to T\)\\functional application}
          [{\(\mathbf{show}: E \to E \to E \to T\)}]
          [{\(\mathbf{ThePendant} : E\)}]
    ]
        [{\(\mathbf{Chrono} : E\)}]
    ]
      [{\(\mathbf{Marle} :E\)}]
    ]
  \end{forest}
  \end{exe}

That's a lot of parentheses! We'll typically assume that functional application associates to the left, so we can rewrite the above as:

\begin{exe}
\ex \(\mathbf{show}(\mathbf{thePendant})(\mathbf{Chrono})(\mathbf{Marle})\)
\label{org32b0faa}
\end{exe}

This brings out what's so compelling about the STLC as a tool for analyzing natural languages - there's a parallelism between the structures implicit in natural language syntax, and the structure of the logical language. This makes it especially easy to translate expressions of natural language into expressions of the STLC.

Compare and contrast the flat structure of a first-order logic expression such as \(S(m,c,p)\)

\begin{exe}
  \ex
  \begin{forest}
    [{\ldots}
    [{\(S\)}]
    [{\(m\)}]
    [{\(c\)}]
    [{\(p\)}]
    ]
  \end{forest}
\end{exe}

In the STLC, the functional expression is always to the left, and the argumental expression to its right. In natural language, this is (arguably) flexible, which we exploit in translating natural language to the STLC:

\begin{exe}
  \ex
  \(\begin{array}{c}\begin{forest}
    [{\ldots}
      [{\(a\)}]
      [{\(b\)}]
    ]
    \end{forest}
    \end{array}
    \rightsquigarrow \mathbf{a}(\mathbf{b})\text{ or
    }\mathbf{b}(\mathbf{a})\text{ (whichever is a wff)}\)
\end{exe}

Now translate the following into expression the STLC:

\begin{exe}
  \ex
  \begin{forest}
    [{andP}
    [{TP}
      [{Josie}]
      [{left}]
    ]
      [{and'}
        [{and}]
        [{TP}
          [{Sarah}]
          [{VP}
            [{hugged}]
            [{Jameson}]
          ]
        ]
      ]
    ]
    \end{forest}
\end{exe}


\subsection{Functional abstraction}
\label{sec:org3aeadd3}

The trademark feature of the lambda calculus (and when its name), is the complex expression known as a \emph{functional abstraction}.

\begin{definition}
\textbf{Functional abstraction}: If \(x\) is a variable of type \(\sigma\), and \(\alpha\) is an expression of type \(\tau\), then \(\lambda x\,.\,\alpha\) is a functional abstraction of type \(\sigma \to \tau\).
\end{definition}

Abstraction always produces a functional type.

Once we come round to the semantics of the STLC, we'll see that there's a special rule for interpreting variables that occur within the body of a functional abstraction.

Are the following all well-formed functional abstractions? Comment on any assumptions we need to make about types.

\begin{exe}
\ex \(\lambda x\,.\,\mathbf{likes}_{E \to E \to T}(x)(x)\)
\ex \(\lambda y\,.\,\mathbf{hug}_{E \to E \to T}(\mathbf{Louise})(x)\)
\ex \(\lambda x\,.\,\mathbf{Josie}\)
\ex \((\lambda x\,.\,x)(\mathbf{Nathan})\)
\label{org5d90f5e}
\end{exe}

We'll exploit functional abstraction to translate, e.g., sentences involving movement dependencies. Following e.g., \autocite{HeimKratzer1998}, we'll translate traces as variables, and insert an abstraction with the same variable name just below the ``moved'' abstraction.

\begin{exe}
\ex Jameson\(_x\), Josie likes \(t_x\)
\label{orgdebca22}
\end{exe}

\begin{exe}
  \ex
  \begin{forest}
    [{\((\lambda x\,.\,\mathbf{likes}(x)(\mathbf{Josie}))(\mathbf{Jameson}): T\)\\functional application}
      [{\(\mathbf{Jameson}: E\)}]
      [{\(\lambda x\,.\,\mathbf{likes}(x)(\mathbf{Josie}): E \to T\)\\functional abstraction}
      [{\(\mathbf{likes}(x)(\mathbf{Josie}): T\)\\functional application}
        [{\(\mathbf{Josie}: E\)}]
        [{\(\mathbf{likes}(x): E \to T\)\\functional application}
          [{\(\mathbf{likes}:E \to E \to T\)}]
          [{\(x: E\)}]
        ]
      ]
      ]
    ]
  \end{forest}
\end{exe}

\section{Semantics of the STLC}
\label{sec:org8363f18}

That's all there is to the syntax of the SLTC, but, since this is a semantics course, we need a way of connecting up these representations with some language-external reality.

\subsection{Typed domains}
\label{sec:orgfdb311d}

Each type is mapped to a \emph{domain} of values - given that we have a recipe for constructing an infinite number of types, we need a recipe for constructing an infinite number of domains.

We start by specifying the domains of the basic types (in our case, \(E, T\)).

\begin{itemize}
\item \(\mathbf{Dom}_E = \set{x | x\text{ is an individual} }\)
\item \(\mathbf{Dom}_T = \set{\mathbf{true},\mathbf{false}}\)
\end{itemize}

Functional types are assigned domains consisting of sets of \emph{functions}; given a functional type \(\sigma \to \tau\), \(\mathbf{Dom}_{\sigma }\) gives the \emph{domain} of the function, and \(\mathbf{Dom}_{\tau}\) gives the \emph{codomain} of the function.  

\begin{definition}
\textbf{Domain of a functional type}: \(\mathbf{Dom}_{\sigma \to \tau } = \set{f | \mathbf{Dom}_\sigma \to \mathbf{Dom}_\tau }\)
\end{definition}

To give a concrete example, we can in fact enumerate every member in the domain of \(T \to T\) (do this!).
