handouts/technical-primer.org
** Interpreting the STLC

Given typed domains, the semantics of the STLC is specified by defining the interpretation function \(\eval*{.}\), which maps constants to values, subject to the following constraint (this just makes such, for example, \(\mathbf{not}\) isn't mapped to an individual or something):

#+begin_definition
*Type-respecting interpretation:* \(\eval*{.}\) is type-respecting if, for any constant \(c: \sigma \), \(\eval*{c} \in \mathbf{Dom}_\sigma \). 
#+end_definition

Now, we recursively define the denotation of an expression relative to an assignment function \(g\) (a total function from variables to values).

The denotations of variables/constants is easy:

- \(\eval*[g]{x} = g(x)\), if \(x\) is a variable.
- \(\eval*[g]{c} = \eval*{c}\), if \(c\) is a constant.
  
The denotation of a function application involves...applying a function to an argument!

- \(\eval*[g]{\alpha(\beta)} = \eval*[g]{\alpha }(\eval*[g]{\beta })\)
  
The denotation of a functional abstraction is a little more involved. It always returns a function:

- \(\eval*[g]{\lambda x\,.\,\alpha } = f\text{ s.t. }f(a) = \eval*[g[x \to a]]{\alpha }\)
  
\(g[x \to a]\) is the assignment function that is exactly like \(g\), except the variable \(x\) is mapped to \(a\). This also has to be type-respecting, so if \(x: \sigma \), then \(a \in \mathbf{Dom}_{\sigma }\).

Compute the following:

#+name: jam
#+begin_exe
\ex \((\lambda x\,.\,\mathbf{likes}(x)(\mathbf{Josie}))(\mathbf{Jameson})\)
#+end_exe

* Proof theory for the STLC

One of the beautiful features of using the STLC for compositional semantics is that it has a simple and elegant proof theory, stated in terms of a notion of simplification called /reduction/, written as \(\Rightarrow\).

This means that we can translate natural language syntax structres into complex expressions of the STLC, then /simplify/ complex expressions using our proof theory, without having to compute the semantic value of a given expression at every step.

Thanks to the /soundness/ of the STLC, we can be sure that - if we don't make any mistakes in our proof - the resulting expression can be interpreted without having to interpret every intermediate step.

The standard axioms for the STLC are as follows:

** \(\beta \)-reduction

Beta-reduction is a straightforward simplification scheme for applications; when we beta-reduce, we remove the \(\lambda x.\) from the functional expression, and subsistute all occurrences of \(x\) in the function body with the argument expression. 

#+name: beta-red
#+begin_exe
\ex \(\vdash (\lambda x_\sigma \,.\,\alpha)(\beta_\sigma) \Rightarrow \alpha[x \mapsto \beta]\)
#+end_exe

Example:

#+name: beta
#+begin_exe
\ex \(\vdash (\lambda x\,.\,\mathbf{likes}(x)(\mathbf{Josie}))(\mathbf{Jameson}) \Rightarrow \mathbf{likes}(\mathbf{Jameson})(\mathbf{Josie})\)
#+end_exe

We can exploit this axiom to simplify complex expressions like ([[beta]]) before interpretation!


** \(\alpha \)-reduction 

The intuition behind alpha reduction is that we can freely rename bound variables, as long as the result is meaning-preserving, e.g.:

#+name: bund
#+begin_exe
\ex \(\vdash \lambda x\,.\,\lambda y\,.\,\mathbf{likes}(x)(y) \Rightarrow \lambda z\,.\,\lambda y\,.\,\mathbf{likes}(z)(y)\)
#+end_exe

Th definition of alpha reduction is a little complex, since we don't want to accidentally change the meaning of the lambda term.

#+name: alpha-red
#+begin_exe
\ex \(\vdash \lambda x\,.\,\alpha \Rightarrow\lambda y\,.\,(\alpha[x \mapsto y])\), where \(y\) isn't a free variable in \(\alpha \), and \(y\) is free for \(x\) in \(\alpha \).
#+end_exe

The first application condition ensures that we don't accidentally bind free variables using alpha reduction, i.e.:

#+name: alpha
#+begin_exe
\ex \(\nvdash \lambda x\,.\,\mathbf{likes}(x)(y) \Rightarrow \lambda y\,.,\mathbf{likes}(y)(y)\)
#+end_exe

The second application condition ensures that, e.g., the \(y\) substituted for \(x\) is not bound in \(\alpha [x \mapsto y]\), since: 

#+name: bund2
#+begin_exe
\ex \(\nvdash \lambda x\,.\,\lambda y\,.\,\mathbf{likes}(x)(y) \Rightarrow \lambda y\,.\,\lambda y\,.\,\mathbf{likes}(y)(y)\)
#+end_exe

** \(\eta\)-reduction

Eta-reduction is another straightforward simplification scheme that we can use to get rid of lambda terms:

#+name: eta
#+begin_exe
\ex \(\vdash \lambda x\,.\,(\alpha(x))\Rightarrow \alpha \)
#+end_exe

You'll often see semanticists write things like:

#+name: eta-normal
#+begin_exe
\ex \(\lambda x\,.\,\mathbf{happy}_{E \to T}(x)\)
#+end_exe

Note that, by \(\eta\)-reduction, this is equivalent to just the constant \(\mathbf{happy}_{E \to T}\).

([[eta-normal]]) is known as the *long form* of an expression of the STLC, and can sometimes be useful for making typing more obvious without explicit annotations.  

** Applications

Our analysis of natural language sentences will typically consist of a couple of steps:

- Starting from a syntactic analysis, translate into a complex expression of the STLC, where each non-terminal node corresponds to a functional application, and movement/binding corresponds to a functional abstraction.
- Simplify the result as much as possible using the proof theory of the STLC.
- Interpret the result in order to provide the truth conditions of the sentence.
  
Let's go through a relatively complex example to see how this all works.

#+name: ev-wind
#+begin_exe
\ex Every window isn't closed.
#+end_exe
 
The example in ([[ev-wind]]) has a salient reading according to which negation takes scope over the universal quantifier. In order to capture this, we'll exploit a syntactic analysis where "every window" moves across negation. We'll assume that movement can be translated as functional abstraction of /any/ type; here, the trace will be translated as a variable of type \(E \to E \to T\).

I'll start by providing you with a syntactic structure and the type of each corresponding STLC expression.

#+begin_export latex
\begin{exe}
  \ex
  \begin{forest}
    [{functional application}
    [{functional application}
      [{\(\mathbf{every}: ET \to ET \to T\)}]
      [{\(\mathbf{window}: E \to T\)}]
    ]
    [{\(\lambda Q\,.\,\ldots\)\\functional abstraction}
    [{functional application}
      [{\(\mathbf{not}: T \to T\)}]
      [{functional application}
        [{\(Q: ET \to T\)}]
        [{\(\mathbf{closed}: E \to T\)}]
      ]
    ]
    ]
    ]
    \end{forest}
\end{exe}
#+end_export

\(\mathbf{every}\) is interpreted as the following function:

#+name: ev-func
#+begin_exe
\ex \(\eval*{\mathbf{every}}(f)(g) = \set{x | f(x) = \mathbf{true}} \subseteq \set{x' | g(x') = \mathbf{true} }\)
#+end_exe

Go through the following steps:

- Translate into a complex expression of the STLC, going through each intermediate step.
- Simplify the result using the proof theory of the STLC.
- Interpret the simplified result. What are the resulting truth-conditions?
  
You should be able to appreciate how the proof theory side-steps many of the complications of directly interpreting complex expressions.
  
#+print_bibliography:

* Footnotes
[fn:2] Unlike the untyped/monotyped lambda calculus, the simply-typed lambda calculus is /strongly normalizing/ (every expression can be simplified to a maximally simple form) and therefore not Turing complete. Non-terminating computations can't be represented - thankfully, this is quite irrelevant to natural language.

[fn:1] Note: you might be more familiar with the notation from [cite:@HeimKratzer1998], who use \(\langle\sigma,\tau \rangle\) as the constructor for function types - arrow notation is standard in the mathematical literature. It's easy to translate between the two:

\[\langle\sigma ,\tau \rangle := \sigma \to \tau \]
