handouts/technical-primer.tex

\subsection{Interpreting the STLC}
\label{sec:org83f0657}

Given typed domains, the semantics of the STLC is specified by defining the interpretation function \(\eval*{.}\), which maps constants to values, subject to the following constraint (this just makes such, for example, \(\mathbf{not}\) isn't mapped to an individual or something):

\begin{definition}
\textbf{Type-respecting interpretation:} \(\eval*{.}\) is type-respecting if, for any constant \(c: \sigma\), \(\eval*{c} \in \mathbf{Dom}_\sigma\). 
\end{definition}

Now, we recursively define the denotation of an expression relative to an assignment function \(g\) (a total function from variables to values).

The denotations of variables/constants is easy:

\begin{itemize}
\item \(\eval*[g]{x} = g(x)\), if \(x\) is a variable.
\item \(\eval*[g]{c} = \eval*{c}\), if \(c\) is a constant.
\end{itemize}

The denotation of a function application involves\ldots{}applying a function to an argument!

\begin{itemize}
\item \(\eval*[g]{\alpha(\beta)} = \eval*[g]{\alpha }(\eval*[g]{\beta })\)
\end{itemize}

The denotation of a functional abstraction is a little more involved. It always returns a function:

\begin{itemize}
\item \(\eval*[g]{\lambda x\,.\,\alpha } = f\text{ s.t. }f(a) = \eval*[g[x \to a]]{\alpha }\)
\end{itemize}

\(g[x \to a]\) is the assignment function that is exactly like \(g\), except the variable \(x\) is mapped to \(a\). This also has to be type-respecting, so if \(x: \sigma\), then \(a \in \mathbf{Dom}_{\sigma }\).

Compute the following:

\begin{exe}
\ex \((\lambda x\,.\,\mathbf{likes}(x)(\mathbf{Josie}))(\mathbf{Jameson})\)
\label{org8ee7f9c}
\end{exe}

\section{Proof theory for the STLC}
\label{sec:org0c21f6f}

One of the beautiful features of using the STLC for compositional semantics is that it has a simple and elegant proof theory, stated in terms of a notion of simplification called \emph{reduction}, written as \(\Rightarrow\).

This means that we can translate natural language syntax structres into complex expressions of the STLC, then \emph{simplify} complex expressions using our proof theory, without having to compute the semantic value of a given expression at every step.

Thanks to the \emph{soundness} of the STLC, we can be sure that - if we don't make any mistakes in our proof - the resulting expression can be interpreted without having to interpret every intermediate step.

The standard axioms for the STLC are as follows:

\subsection{\(\beta\)-reduction}
\label{sec:org9a7a0ce}

Beta-reduction is a straightforward simplification scheme for applications; when we beta-reduce, we remove the \(\lambda x.\) from the functional expression, and subsistute all occurrences of \(x\) in the function body with the argument expression. 

\begin{exe}
\ex \(\vdash (\lambda x_\sigma \,.\,\alpha)(\beta_\sigma) \Rightarrow \alpha[x \mapsto \beta]\)
\label{org5a18257}
\end{exe}

Example:

\begin{exe}
\ex \(\vdash (\lambda x\,.\,\mathbf{likes}(x)(\mathbf{Josie}))(\mathbf{Jameson}) \Rightarrow \mathbf{likes}(\mathbf{Jameson})(\mathbf{Josie})\)
\label{org9919965}
\end{exe}

We can exploit this axiom to simplify complex expressions like (\ref{org9919965}) before interpretation!


\subsection{\(\alpha\)-reduction}
\label{sec:org9aefb62}

The intuition behind alpha reduction is that we can freely rename bound variables, as long as the result is meaning-preserving, e.g.:

\begin{exe}
\ex \(\vdash \lambda x\,.\,\lambda y\,.\,\mathbf{likes}(x)(y) \Rightarrow \lambda z\,.\,\lambda y\,.\,\mathbf{likes}(z)(y)\)
\label{orgac6238c}
\end{exe}

Th definition of alpha reduction is a little complex, since we don't want to accidentally change the meaning of the lambda term.

\begin{exe}
\ex \(\vdash \lambda x\,.\,\alpha \Rightarrow\lambda y\,.\,(\alpha[x \mapsto y])\), where \(y\) isn't a free variable in \(\alpha\), and \(y\) is free for \(x\) in \(\alpha\).
\label{org5b9c5d5}
\end{exe}

The first application condition ensures that we don't accidentally bind free variables using alpha reduction, i.e.:

\begin{exe}
\ex \(\nvdash \lambda x\,.\,\mathbf{likes}(x)(y) \Rightarrow \lambda y\,.,\mathbf{likes}(y)(y)\)
\label{org4edcd5a}
\end{exe}

The second application condition ensures that, e.g., the \(y\) substituted for \(x\) is not bound in \(\alpha [x \mapsto y]\), since: 

\begin{exe}
\ex \(\nvdash \lambda x\,.\,\lambda y\,.\,\mathbf{likes}(x)(y) \Rightarrow \lambda y\,.\,\lambda y\,.\,\mathbf{likes}(y)(y)\)
\label{orgfb8771f}
\end{exe}

\subsection{\(\eta\)-reduction}
\label{sec:orgbfcb37b}

Eta-reduction is another straightforward simplification scheme that we can use to get rid of lambda terms:

\begin{exe}
\ex \(\vdash \lambda x\,.\,(\alpha(x))\Rightarrow \alpha\)
\label{org9d4f5e8}
\end{exe}

You'll often see semanticists write things like:

\begin{exe}
\ex \(\lambda x\,.\,\mathbf{happy}_{E \to T}(x)\)
\label{org1ed1a7b}
\end{exe}

Note that, by \(\eta\)-reduction, this is equivalent to just the constant \(\mathbf{happy}_{E \to T}\).

(\ref{org1ed1a7b}) is known as the \textbf{long form} of an expression of the STLC, and can sometimes be useful for making typing more obvious without explicit annotations.  

\subsection{Applications}
\label{sec:orgb6644fa}

Our analysis of natural language sentences will typically consist of a couple of steps:

\begin{itemize}
\item Starting from a syntactic analysis, translate into a complex expression of the STLC, where each non-terminal node corresponds to a functional application, and movement/binding corresponds to a functional abstraction.
\item Simplify the result as much as possible using the proof theory of the STLC.
\item Interpret the result in order to provide the truth conditions of the sentence.
\end{itemize}

Let's go through a relatively complex example to see how this all works.

\begin{exe}
\ex Every window isn't closed.
\label{orgddf0a94}
\end{exe}

The example in (\ref{orgddf0a94}) has a salient reading according to which negation takes scope over the universal quantifier. In order to capture this, we'll exploit a syntactic analysis where ``every window'' moves across negation. We'll assume that movement can be translated as functional abstraction of \emph{any} type; here, the trace will be translated as a variable of type \(E \to E \to T\).

I'll start by providing you with a syntactic structure and the type of each corresponding STLC expression.

\begin{exe}
  \ex
  \begin{forest}
    [{functional application}
    [{functional application}
      [{\(\mathbf{every}: ET \to ET \to T\)}]
      [{\(\mathbf{window}: E \to T\)}]
    ]
    [{\(\lambda Q\,.\,\ldots\)\\functional abstraction}
    [{functional application}
      [{\(\mathbf{not}: T \to T\)}]
      [{functional application}
        [{\(Q: ET \to T\)}]
        [{\(\mathbf{closed}: E \to T\)}]
      ]
    ]
    ]
    ]
    \end{forest}
\end{exe}

\(\mathbf{every}\) is interpreted as the following function:

\begin{exe}
\ex \(\eval*{\mathbf{every}}(f)(g) = \set{x | f(x) = \mathbf{true}} \subseteq \set{x' | g(x') = \mathbf{true} }\)
\label{org84450d9}
\end{exe}

Go through the following steps:

\begin{itemize}
\item Translate into a complex expression of the STLC, going through each intermediate step.
\item Simplify the result using the proof theory of the STLC.
\item Interpret the simplified result. What are the resulting truth-conditions?
\end{itemize}

You should be able to appreciate how the proof theory side-steps many of the complications of directly interpreting complex expressions.

\printbibliography
\end{document}